[
  "obsidian-icons-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-title-index",
  "recent-files-obsidian",
  "buttons",
  "obsidian-plugin-prettier",
  "table-editor-obsidian",
  "consistent-attachments-and-links",
  "obsidian-linter",
  "obsidian-paste-image-rename",
  "obsidian42-brat",
  "obsidian-excalidraw-plugin",
  "quickadd",
  "obsidian-hypothesis-plugin",
  "oz-clear-unused-images",
  "homepage",
  "dataview",
  "calendar",
  "templater-obsidian"
]